package util_p;

import java.util.regex.Pattern;

public class RegexMain {

	public static void main(String[] args) {
		String [] mmArr = {
				"장동건","건","장서건","장혁","장남건","장3","장빈건","*","***","*******",
                "장","장군","","최장군","박장군","장군님","장장장장장장장","된장","장장","고추장",
                "미란다커","키커","쌍피","계피","원두커피장군",
                "장장장","김앤장이다","현빈","원빈","미스터빈","커피빈","커피","원두커피","장희빈",
                "ㄱㄴㄷ","ㄱㄹㄴ","ㅐㅓㅣㅔㅐ","ㅐㅔㅓㅐㅑㅓ","ㄱㅓㅔㅔㅔㄹㄴ",
                "하하하","하호허","팉툍하","하학","하햐","가긱공국","짱쩡맨","쑥ㄴ밬","샹쏑쑗",
                "다","공석호","김희애",
                "나야비","나비야","농ㅂ왕창","장ㄴ비용솽",
                "너탈비털아붕니","너비아니","헤르너비아샹쵕",
                "123-456","1234-5678",
                "1234-5678-9012","123-5678-9012","12-5678-9012","12-568-9012",
                "123-678-9012","123-567833-9012","12-58-9012","1a","sdaf","asdsDsxx","ass@ioins","XSDOxoziv",
                "abc","abc_def","1234","9846","ab_1234","ab1234", "aBix38","asd12@vSdv",
                "aaa@aaa.aaa","aaaaaa.aaa@","aaa12aaa_aaa@",
                "ab56","AABB","aBCd","1","3","1234abc@aaa.aaa",
                "1234abc@aaa.a","1a2b","a12",
                "^","^^","12^34abc@aaa.aaa","1a2b^","^a12","123456.^",
                "\\^","^\\^",".^","\\^^",
                "+", "+++++++++",
                "1234abc@aaa.aa.va","1234abc@a.aa.a.a.va",
		};
		
		String [] ppArr = {
				"장", "장군", "장.", ".장", ".장.",
				"장+", "장*", "장?",
				"장.*", ".*빈", ".*장.*",
				".*빈건", ".*(빈건)", ".*빈|건", ".*(빈|건)", ".*[빈건]",
				".*(커피|장군)", ".*[커피장군]",
				"[0-9]+", "\\d+",
				"[^0-9]+", "\\D+",
				"[a-zA-Z0-9_]+", "\\w+",
				"[^a-zA-Z0-9_]+", "\\W+",
				"[a-zA-Z0-9]+@[a-zA-Z0-9.]+",
				".{4}", ".{3,}", ".{3,7}",
				"\\d{2,3}-\\d{4}-\\d{4}",
				"[^0-9]+", "[0-9^]+", "\\^+", "[0-9\\^]+", "[^^]+",
				"\\*", "\\**", "[*]", "[*]*",
				"\\+", "\\++", "[+]", "[+]+",
				"[ㄱ-ㅎ]+", "[ㅏ-ㅣ]+", "[가-힣]+", "[가-힣ㄱ-ㅎㅏ-ㅣ]+",
				".*[가-깋].*", ".*([ㄴ나-닣][ㅂ바-빟][ㅇ아-잏]).*",
				"(?=[a-z])", "(?=.*[a-z])", "(?=[a-z]).*",
				// (?=.*[a-z]) : 조건 검사 ==> 실제 검사와 결합하여 사용
				// (?=[a-z]).* : ?=[a-z](조건) and .* ==> 을 포함하고
				// [a-z]를 포함하고 있다
				"^(?=[a-z]+$).+", 	// 영문으로만 적용
				
				// (?=조건)(?=조건) : and로 결합
				"^(?=.*[A-Z]).{3,}$",  // 3자이상, 대문자 포함 
				"^(?=.*[A-Z])(?=.*[a-z]).{3,}$",  // 3자 이상 대문자, 소문자 포함
				"^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9]).{3,}$",  // 3자이상, 대문자, 소문자, 숫자 포함
				"^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.{3,})[a-zA-Z0-9]+$",  // (3자이상, 대문자, 소문자, 숫자 포함)이 되면서 [a-zA-Z0-9]+에 충족 되어야함
				"^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])[a-zA-Z0-9]{3,}$",  // (3자이상, 대문자, 소문자, 숫자 포함)이 되면서 [a-zA-Z0-9]+에 충족 되어야함
		};
		
		for (String pp : ppArr) {
			System.out.print(pp+" : ");
			for (String mm : mmArr) {
				if(Pattern.matches(pp, mm)) {	// Pattern.matches(패턴, 검사하려는 문자열)
					System.out.print(mm+", ");
				}
			}
			System.out.println();
		}
	}

}
